Documents/НачислениеЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>НачислениеЗарплаты</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УчетЗатрат</xr:Item>
				<xr:Item>CalculationRegister.Начисления</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Начисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГрафикРаботы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГрафикиРаботыСотрудников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказательРасчета</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/КадроваяИсторияСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>КадроваяИсторияСотрудников</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Оклад</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Работает</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/НачислениеЗарплаты/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура АвтоматичесокеЗаполнениеНаСервере() 
	Объект.Начисления.Очистить();
	
	Если НЕ ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = СтрШаблон("Период не заполнен!");
		СообщениеПользователю.Сообщить(); 
		
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеСотрудников.Сотрудник КАК Сотрудник,
	|	ДанныеСотрудников.Период КАК ПериодОклада,
	|	ДанныеСотрудников.Оклад КАК Оклад,
	|	ДанныеСотрудников.ГрафикРаботы КАК ГрафикРаботы,
	|	ДанныеСотрудников.Работает КАК Работает
	|ИЗ
	|	РегистрСведений.КадроваяИсторияСотрудников КАК ДанныеСотрудников
	|ГДЕ
	|	(ДанныеСотрудников.Период МЕЖДУ &ДатаНачала И &ДатаКонца
	|			ИЛИ ДанныеСотрудников.Период В
	|				(ВЫБРАТЬ
	|					ДанныеСотрудниковСрезПоследних.Период
	|				ИЗ
	|					РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(&ДатаКонца, ) КАК ДанныеСотрудниковСрезПоследних)
	|			ИЛИ ДанныеСотрудников.Период В
	|				(ВЫБРАТЬ
	|					ДанныеСотрудниковСрезПоследних.Период
	|				ИЗ
	|					РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(&ДатаНачала, ) КАК ДанныеСотрудниковСрезПоследних))
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеСотрудников.Сотрудник.Наименование,
	|	ПериодОклада УБЫВ
	|ИТОГИ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Оклад)
	|ПО
	|	Сотрудник"; 
	
	КонецПериода = КонецМесяца(Объект.ПериодНачисления);
	НачалоПериода = НачалоМесяца(Объект.ПериодНачисления); 
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоПериода);
	Запрос.УстановитьПараметр("ДатаКонца", КонецПериода);
	
	ВыборкаИтоги =  Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаИтоги.Следующий() Цикл
		
		ПредыдущаяЗаписьДата = Неопределено;  
		
		ВыборкаДетальные = ВыборкаИтоги.Выбрать(); 
		
		Пока ВыборкаДетальные.Следующий() Цикл
			
			Если НЕ ВыборкаДетальные.Работает Тогда 
				ПредыдущаяЗаписьДата = ВыборкаДетальные.ПериодОклада;
				Продолжить;
			Иначе
				
				СтрокаТЧ = Объект.Начисления.Добавить();
				
				СтрокаТЧ.Сотрудник = ВыборкаДетальные.Сотрудник;
				СтрокаТЧ.ГрафикРаботы = ВыборкаДетальные.ГрафикРаботы;
				СтрокаТЧ.ВидРасчета = ПланыВидовРасчета.Начисления.Оклад;
				СтрокаТЧ.ПоказательРасчета = ВыборкаДетальные.Оклад; 
				СтрокаТЧ.ДатаНачала = Макс(ВыборкаДетальные.ПериодОклада, НачалоПериода);
				
				Если ПредыдущаяЗаписьДата = Неопределено Тогда
					СтрокаТЧ.ДатаОкончания = КонецПериода;
				Иначе 
					СтрокаТЧ.ДатаОкончания = ПредыдущаяЗаписьДата - 1 ;
				КонецЕсли;
				
				ПредыдущаяЗаписьДата = ВыборкаДетальные.ПериодОклада;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура АвтоматичесокеЗаполнение(Команда)
	АвтоматичесокеЗаполнениеНаСервере();
КонецПроцедуры
